
/*
************************************************************************
*                北京邮电大学 K60 学习例程                                        
* 文件名 :[LED.c] 
* 描  述 ：LED函数定义
*设计改进：snowwolf
*  Email ：snowwolf2012@qq.com
* 说  明 ：LED函数定义
***********************************************************************
*/

#include  "LED.H"


/*************************************************************************
*  函数名称：LED_init
*  功能说明：初始化LED端口，设置IO口为输出方向
*  参数说明：无
*  函数返回：无
*  修改时间：2012-2-2   已测试
*  备    注：
*************************************************************************/
void    LED_init(void)
{
    gpio_init(LED_PORT,LED0,GPO,LED_OFF);
    gpio_init(LED_PORT,LED1,GPO,LED_OFF);
    gpio_init(LED_PORT,LED2,GPO,LED_OFF);
    gpio_init(LED_PORT,LED3,GPO,LED_OFF);
}

/*************************************************************************
*  函数名称：led
*  功能说明：设置LED灯亮灭
*  参数说明：LEDn        LED端口（LED0、LED1、LED2、LED3）
*            status      LED状态（LED_ON、LED_OFF）
*  函数返回：无
*  修改时间：2012-2-2   已测试
*  备    注：
*************************************************************************/
void    led(LEDn ledn,LED_status status)
{
    GPIO_SET_1bit(LED_PORT,ledn,status);
}

void LED_turn(LEDn ledn)
{
    LED_TURN(ledn);
}

/*************************************************************************
*  函数名称：water_lights
*  功能说明：四个LED轮流闪烁，流水灯
*  参数说明：无
*  函数返回：无
*  修改时间：2012-2-10   已测试
*  备    注：
*************************************************************************/
void water_lights(void)
{

    LEDn    n;
    LED_INIT();
    for(n=LED0;n<=LED3;n++)
    {
        led(n,LED_ON);
        LED_DELAY_MS(100);
        led(n,LED_OFF);
    }
}








